import math

for t in range(0, 6):
    f = math.exp(-t)
    print(f"t={t} -> {f:.4f}")
 
##   e^-t  (Decays)   اس سالب زي الي في القانون بتتغير مع الوقت او بتضعف مع الوقت وده كان المشكله عندنا في الاول  




for t in range(0, 6):
    f = 3 * t + 2
    print(f"t={t} -> {f}")

##   a*t+b  (Linear)  ثابته وخطيه في التغيير 





for t in range(0, 6):
    f = math.exp(t)
    print(f"t={t} -> {f:.4f}")

##    e^t  (Exponential) بتدبل بسرعه بالاعتماد على الاس المرفوع ليه  متغيره بنسبه كبيره 



## الصح 

for t in range(0, 6):
    f = math.exp(-t)
    print(f"t={t} -> {f:.4f}")

##  هوا بيقول بتتغير مع الوقت وزي القانون الاصلي الي عندنا اس سالب يبقى فعلا مش ثابته ولا بتدبل لا بتضعف مع الوقت  بس مش بتوصل للصفر 

